#include <iostream>
int a; //потрапляють глобальні не ініціалізовані змінні
int b{0}; // або глобальні ініціалізовані нулем змінні
int c;
int d;
int e;
int main ()
{
      static int f; // також потрапляє статична не ініціалізована змінна
      std::cout<<"В сегмент .bss потрапляють\n"<< 
      "глобальні не ініціалізовані змінні,\n"<<
      "або ініціалізовані нулем, а також статичні не ініціалізовані змінні"<<std::endl;
      std::cout<<&f<<"\t  /\\  "<<std::endl;
      std::cout<<&e<<"\t /  \\ "<<std::endl;
      std::cout<<&d<<"\t/____\\"<<std::endl;
      std::cout<<&c<<"\t  ||  "<<std::endl;
      std::cout<<&b<<"\t  ||  "<<std::endl;
      std::cout<<&a<<"\t  ||  "<<std::endl;
      std::cout<<"\nВ даний сегмент пам'яті\n"<<
      "дані записуються знизу вверх відносно порядку їх задання"<<std::endl;
      return 0;
}